# encoding: UTF-8

module Populator
  # This module adds several methods for generating random data which can be
  # called directly on Populator.
  module Random
    WORDS = %w(প্রযুক্তির উন্নয়নের সাথে সাথে এই সোশাল নেটওয়ার্কিং সাইটগুলোতে সবারই ব্যাপক পদসঞ্চালন টুইটার ও ফেসবুকের মাধ্যমে ক্ষণিকের মাঝেই জেনে যাওয়া যায় সারা পৃথিবীর অনেক খবর আন্তর্জাতিক সাংবাদিকগণ তাদের ব্যক্তিগত টুইটার অ্যাকাউন্ট ব্যবহার করে থাকেন খুবই নিয়মিভাবে তেমনি সমস্ত ব্যবসায়ী প্রতিষ্ঠানও এখানে সংযুক্ত হয়েছে সহজেই মানুষের কাছে পৌছাতে তাদের কাছে নিজেদের সেবা ও পণ্য সম্পর্কে জানিয়ে দেয়া ভোক্তাদের কাছ থেকে ফিডব্যাক নেয়া এবং সেই অনুযায়ী ব্যবসার উৎপাদন বৃদ্ধি করার নজীর রয়েছে পর্যন্ত শিক্ষক বুদ্ধিজীবী এবং খেলোয়ার ও অন্যান্য সেলিব্রিটিরাও তাদের ভক্তদের অনেক কাছে চলে যেতে ব্যবহার করে ফেসবুক টুইটারসহ অন্যান্য সোশাল নেটওয়ার্ক এই লেখাতে আমি কেবল ফেসবুকের ভুল ব্যবহারের ফলে উদ্ভুত কিছু সমস্যার ব্যাপারে কথা বলবো তাও আবার বাংলাদেশের প্রেক্ষাপটে সাধারণ তরুণ প্রজন্মের ছেলেমেয়েদের ব্যবহারের মাঝে অশ্লীলতা ছড়িয়ে পড়ার বিষয়টা নিয়ে লেখাটা পড়ার সময় মাথায় রাখতে হবে ফেসবুক ব্যবহারের সুস্থ সামাজিক নেটওয়ার্কিং-এর সমস্ত ভালো দিকগুলোকে হিসেবে রেখে কেবলমাত্র উদ্ভুত কিছু সমস্যা নিয়ে আলোচনা করা হচ্ছে ফেসবুক যখন শুরু ৪/৫ বছর আগে তখন এই দেশে ইন্টারনেট ব্যবহারকারী খুব বেশি ছিলনা মূলত আর্থিকভাবে সচ্ছল এবং শহরবাসীরাই ছিলো এই ফেসবুকের ব্যবহারকারী ধীরে ধীরে এই সাইট জনপ্রিয় হতে থাকে সারা বিশের মতন বাংলাদেশেও হবারই কথা এখানে সময় কাটানো যায় পুরোনো বন্ধুদেরকে নিমিষেই কাছে পাওয়া যায় কথা বলা যায় ছবি শেয়ার করা যায় এখন যুক্ত হয়েছে ভিডিও চ্যাট আত্মীয়স্বজন এবং বন্ধুবান্ধবদের কাছাকাছি পেতে এরকম ফেসবুক জনপ্রিয় হবারই কথা কিন্তু আমাদের দেশের যাবতীয় প্রজন্মের একটা বিস্তীর্ণ অংশ অশিক্ষিত অল্পশিক্ষিত তাই ফেসবুকে একাউন্ট না থাকাটা অনেকেই নিজের মান-ইজ্জতের হানিকর ভেবেও একটা একাউন্ট খুলেছেন এমন কথাও জানি বছরখানেক আগেও আমার এলাকার স্টুডিওতে ঝুলানো ছিল এখানে ফেসবুকের ছবি তোলা হয় বলাই বাহুল্য, এটা মূলত গার্মেন্টসে কর্মরত পুরুষ এবং মূলত নারীকর্মীদের সুবিধার্থে একটা ব্যবসায়ীক আয়োজন ছিল একইভাবে ওয়াইম্যাক্সের আগমনের পরে সাইবার ক্যাফেগুলো ব্যবসা আগের মতন জমজমাট করতে না পারায় তাদের দোকানেও দেখা যায় এখানে ফেসবুক ইউজ করা যায় আমি ফেসবুকের একদম প্রথম থেকেই ছিলাম তখন আমার ইন্টারনেট কানেকশন ছিল এই দীর্ঘ সময় একটা অভিজ্ঞতা হলো এখন স্কুলের পিচ্চি পিচ্চি ছেলেমেয়েরাও নিয়মিত ফেসবুক ইউজ করে আমার এক বন্ধুর ছোটবোন বছর খানেক আগে বেশি নিয়মিত ফেসবুকিং করত যার বয়স ছিল মাত্র ১১ বছর এরকম আরো অজস্র উদাহরণ আছে প্রযুক্তির কারণে শিশুরা স্কুলে যাবার আগেই এখন মোবাইলের সমস্ত ফাংশন প্রায় ঘেঁটে ফেলে এটাও হয়ত অমনই একটা ব্যাপার সেদিন একজনের নামের উপরের লিঙ্কে ক্লিক করে তার প্রোফাইলে চলে গেলাম সামনেই পেলাম তার সদ্য সব পেইজে লাইক দেয়া নামগুলো একটা আমার পছন্দের পেইজ তার পাশেই প্রেমপত্র নিয়ে একটা পেজ সেখানেও ক্লিক করলাম আচ্ছা এরপর ভয়াবহ রকমের খ্যাত ফালতু একেকটা প্রেমের কথা বীভৎস সব আধা-অশ্লীল পূর্ণ অশ্লীল সো কলড রোমান্টিক ছবি আর কে কে জেগে আছেন লাইক দিন ভালো লাগলে শেয়ার করুন, লাইক দিন শেয়ার করুন টাইপের স্বাভাবিক ফেরিওয়ালাগিরি দেখলাম আমি আরো বেশি অবাক হলাম যখন দেখি ১০ হাজারের উপরে লাইক পেইজটাতে তাতে প্রতিটি সুপার খ্যাত পোস্টেই একশর উপরে লাইক দেয়া অর্থাৎ এদের প্রতিটি পোস্টই ছড়িয়ে গেছে অজস্র ছেলেমেয়ের মাঝে দিগ্বিদিগ জ্ঞানশূণ্য টিপিক্যাল মডারেট মুসলিমের অন্তরকে ধারণ করেছিলাম অনেক বছর আমি জানি যতক্ষণ না পর্যন্ত নিজেকে অশ্লীল দৃশ্য থেকে সম্পূর্ণরূপে নিজেকে রক্ষা করতে নিয়াত করেছিলাম কখনই আল্লাহর অনুভবের প্রশান্তি অর্জন করতে পারিনি একটুও যখনই নির্লজ্জ অপছন্দনীয় কোন কিছুতে জড়িয়ে পড়ি অন্তরের শান্তি হারিয়ে যায় আল্লাহর স্মরণ থেকে গাফেল হয়ে যাই এইটা খুব খারাপ জিনিস খুব খারাপ আর খুব বেশি সাবধান থাকার মতন একটা বিষয় নিজের গায়ে একটা ছুরির আঘাত আসাকে অনুমুতি দেয়াও এর চাইতে কম ক্ষতিকর বলে আমার অনুভব হয় হেফাজতি ইসলামের ছয় এপ্রিলের সমাবেশ শেষ হওয়ার মধ্য দিয়ে টান টান উত্তেজনা এবং আতংকের সাময়িক অবসান ঘটেছে সাময়িক এ কারণে যে সমাজের বিরোধ যে রাজনৈতিক রূপ লাভ করেছে তাতে এই টান টান অবস্থার পরিসমাপ্তি সহজে ঘটবে না বরং হেফাজতে ইসলামের মধ্য দিয়ে নতুন একটি রাজনৈতিক শক্তির আবির্ভাব আমরা দেখলাম যাদের সম্পর্কে সমাজের ধারণা খুবই অল্প বিদ্যমান দ্বন্দ্ব সংঘাতের বাস্তবতা ও চরিত্রের কারণে তারা তাদের ধর্মীয় দাবিকে রাজনৈতিক দাবি হিশাবে হাজির করতে সক্ষম হয়েছে শহুরে ভদ্রলোক ও বিদ্যমান ব্যবস্থার সুবিধাভোগী শ্রেণি তাদের পশ্চাতপদ ও গণবিরোধী চিন্তাচেতনার আবর্জনা এরপরও ঘাঁটতে থাকবে দুর্গন্ধ ছড়াতে থাকবে তারা বুঝতে চেষ্টা করবে না কেন ঘটনাটি ঘটল এর আর্থ-সামাজিক ও সাংস্কৃতিক কারণ কী হতে পারে গণতান্ত্রিক লড়াই সংগ্রামের বিপজ্জনক ঘাটতিগুলো কোথায় না সেই কঠিন পর্যালোচনার জায়গায় তারা যাবে না তারা বলতে থাকবে এরা অসভ্য অশিক্ষিত ও বর্বর এরা যদি সমাজে প্রাধান্য বিস্তার করে তাহলে সভ্যতা বলে কিছু থাকবে না নোংরা বর্ণবাদ ও শ্রেণিঘৃণার তীব্রতা দেখব আমরা ইসলামের বিরুদ্ধে বিদ্বেষ ও ঘৃণার রাজনীতি সাম্রাজ্যবাদী দেশগুলোর ইসলাম আতংকের সঙ্গে একাকার হয়ে যেতে থাকবে বাংলাদেশে যারা খেয়ে না খেয়ে ইসলাম বিরোধী রাজনীতির বিরোধিতা করেন তারা জোরে শোরে প্রচার করছেন হেফাজতে ইসলাম আসলে জামাতে ইসলামেরই নামান্তর একাত্তরে জামাতে ইসলামির ভূমিকার কারণে ইসলাম সম্পর্কে জনগণের মধ্যে যে মন্দ ধারণা রয়েছে তারা তাকে ব্যবহার করে হেফাজতে ইসলামকেও কালিমালিপ্ত করতে চাইছেন অথচ জামায়াত ও হেফাজতে ইসলামের সম্পর্ক সাপে নেউলে বললেও খুব অত্যুক্তি হয় না এই ধরণের প্রচার বা প্রপাগাণ্ডা ইসলামের প্রতি শিক্ষিত মধ্যবিত্ত শ্রেণির একাংশের ঘৃণা ও বিদ্বেষ শুধু নয় তুমুল অনাগ্রহও প্রমাণ করে বাংলাদেশে ইসলামি রাজনীতির বিভিন্ন ধারাকে বুঝতেও সহায়ক হয় না বলাবাহুল্য হেফাজতে ইসলামির কর্মসূচি রাজনীতি কিম্বা তাদের কাজের কৌশল ইত্যাদি সবকিছুরই পর্যালোচনার প্রয়োজন রয়েছে ধর্ম ও রাজনীতি উভয় দিক থেকে হেফাজতে ইসলামের সমালোচনা বা পর্যালোচনা যে কেউই করতে পারেন কিন্তু শুরুতেই যে দিকটা বোঝা গুরুত্বপূর্ণ সেটা হচ্ছে ছয় তারিখের কর্মসূচি বাংলাদেশের সমাজ ও রাজনীতির একটা গুণগত পরিবর্তন ঘটিয়েছে বাংলাদেশের রাজনীতিতে ইসলাম আর গৌণ অবস্থানে নয় বরং নির্ধারক অবস্থানে নিজেকে হাজির করবার ইঙ্গিত দিয়ে গেছে এট ভাল কি মন্দ সেই বিচার এখানে এখন করব না বরং এই সমাবেশের কয়েকটি শিক্ষণীয় দিক রয়েছেন সেই দিকগুলোই সংক্ষেপে আলোচনা করব এটা তো পরিষ্কার যে এই নষ্ট শহরে যে সকল জালিম শ্রেণি এই দেশের জনগণকে শোষণ লুন্ঠন করে টিকে থাকে এবং যারা মনে করে এই দেশ শুধু তাদের গণমানুষের পদভারে শহর প্রকম্পিত করে হেফাজতের জমায়েত বুঝিয়ে দিয়েছে তারা ছাড়াও বাংলাদেশে আরও কোটি কোটি মানুষ আছে যে যুদ্ধ এই জালিম শ্রেণী শুরু করেছে তার সম্ভাব্য পরিণতি কী হতে পারে তার খানিক আভাস মাত্র তারা দিয়ে গেল ক্ষমতাসীন ও তাদের পক্ষের শ্রেণি ও শক্তিগুলো সেই দিকেই দেশকে নেবে কিনা সেটা এখন তাদের ওপরই নির্ভর করছে হেফাজতে ইসলাম শুধু ঢাকায় সমাবেশ করতে চায় নি তারা তাদের কর্মসূচিকে বলেছে ‘লং মার্চ’ মাও জে দং এর নেতৃত্বে চিনের নিপীড়িত লড়াকু শ্রমিক কৃষকদের নিয়ে গঠিত গণসৈনিকদের যুদ্ধকৌশল হিশাবে এই দীর্ঘ পদযাত্রার সঙ্গে তাদের কর্মসূচির নামকরণে মিল রাখার মধ্য দিয়ে হেফাজতে ইসলাম বুঝিয়ে দিয়েছে পার্থক্য থাকলেও মজলুমের যে কোন লড়াইয়ের ধরণের মধ্যে মিল থাকা অস্বাভাবিক কিছু নয় তাছাড়া তাঁরা দাবি করেছেন দীর্ঘ পদযাত্রার মধ্য দিয়ে জনগণকে সম্পৃক্ত করবার এই কৌশল কমিউনিস্টদের রণকৌশল বলা ঐতিহাসিক ভুল কারণ ইসলামের ইতিহাসে এই ধরণের পদযাত্রার প্রচুর উদাহরণ রয়েছে এই সমাবেশ পণ্ড করবার জন্য সরকার সব রকমের চেষ্টা করেছে শেষ চেষ্টা ছিল সেক্টরস কমাণ্ডার্স ফোরাম সম্মিলিত সাংস্কৃতিক জোট ঘাতক দালাল নির্মূল কমিটি এবং আরও সাতাশটি সংগঠ্নকে মাঠে নামানো হেফাজতে ইসলামকে ‘প্রতিরোধ’ করবার জন্য হরতাল ও অবরোধের কর্মসূচিও দেওয়া হয়েছে ট্রেন বাস ফেরি নৌকা লঞ্চসহ সব যোগাযোগ বন্ধ করে দেওয়া হয় তারপরও লক্ষ লক্ষ মানুষের বৃহত্তম যে সমাবেশ ঢাকায় হয়েছে তা বাংলাদেশের ইতিহাসে এক অবিস্মরণীয় ঘটনা হয়ে থাকবে ঢাকায় যারা আসতে পারেন নি তারা সারাদেশের বিভিন্ন স্থানে সমাবেশ করেছেন যদি তাদের হিসাব নেওয়া হয় এবং যে তথ্য পাওয়া যাচ্ছে তাতে দেখা যায় বড়োজোর এক দশমাংশ মানুষ ঢাকায় পৌছাতে পেরেছেন এরপরও যে লক্ষ লক্ষ মানুষ ঢাকায় এসেছে তা রীতিমতো বিস্ময়কর এটাও বিস্ময়কর যে সমাবেশ আগাগোড়াই ছিল শান্তিপূর্ণ হেফাজতের নেতৃবৃন্দ পুলিশ ও প্রশাসনকে যে কথা দিয়েছেন সেই ওয়াদা মাফিক সময় মতো তাঁদের সমাবেশ শেষ করেছেন এতে স্পষ্ট বোঝা গেল কর্মীদের ওপর নেতৃবৃন্দের নিয়ন্ত্রন যথেষ্ট শক্তিশালী শান্তিপূর্ণ লড়াইয়ের উদাহরণ তাঁরা তৈরী করলেন এবার এই সমাবেশের দুই একটি গুরুত্বপূর্ণ তাৎপর্যের ইঙ্গিত দিয়ে শেষ করব প্রথমত এ যাবতকাল বাংলাদেশের রাজনীতিতে ধর্ম গুরুত্বপূর্ণ বিষয় হয়ে থাকলেও এই প্রথম বার ইসলাম নিজের প্রাধান্য নিয়ে হাজির হোল শেখ হাসিনা ইসলামি রাজনীতিকে নির্মূল করতে গিয়ে তাকে আরও প্রতিষ্ঠিত করে গেলেন ভাষা ও সংস্কৃতিভিত্তিক জাতীয়তাবাদের যে আধিপত্য গত ৪২ বছর আমরা বাংলাদেশে দেখেছি তার দুর্বলতা ও ক্ষয়ের দিকটাও এতে প্রকট হয়ে উঠল দ্বিতীয়ত ইসলাম প্রশ্ন আগামি দিনে বাংলাদেশের রাজনীতির নির্ধারক হয়ে উঠবে রাজনীতি যেভাবে গঠিত হতে থাকবে তার মধ্যে ইসলাম প্রশ্নের মীমাংসা গুরুত্বপূর্ণ কর্তব্য হয়ে নানা ভাবে হাজির হতে থাকবে সমাজতত্ত্বে রাজনৈতিক বিশ্লেষণে সাংস্কৃতিক বিনির্মাণে কে কিভাবে করবেন তার ওপর তাঁদের রাজনৈতিক ভবিষ্যৎ নির্ভর করবে ইসলাম প্রশ্নের সঠিক মোকাবিলা না হলে রাজনীতিতে নেতিবাচক প্রবণতা বাড়বে অন্যদিকে এর সঠিক মীমাংসা বাংলাদেশের রাজনীতির বৈপ্লবিক রূপান্তর ঘটাতে পারে অর্থাৎ বাংলাদেশের বৈপ্লবিক রূপান্তরের প্রশ্নও ইসলাম প্রশ্নের মীমাংসার সঙ্গে আরও সরাসরি যুক্ত হয়ে পড়ল অর্থাৎ ইসলাম আদৌ জালিমের বিরুদ্ধে মজলুমের লড়াইয়ের সহায়ক হতে পারে কিনা সেটা এখন রাজনীতির ব্যবহারিক প্রশ্নে পরিণত হবে একে উপেক্ষা করবার সুযোগ কম বাংলাদেশের জনগণের বিপ্লবী রণনীতি ও রণকৌশলের বয়ান অন্যদের কাছ থেকে মুখস্থ ধার করবার ও বাইরে থেকে আমদানি করবার সুযোগ কমে যাবে গণবিচ্ছিন্ন থেকে কেতাবি দিবাকল্পনা পেটিবুর্জোয়া অতো তাড়াতাড়ি হয়তো ত্যাগ করবে না কিন্তু যাঁরা জানেন কেতাব নয় জনগণই বিপ্লব করে তারা বাংলাদেশের মজলুম বা নিপীড়িত জনগণকে আন্তরিক ভাবেই বোঝার চেষ্টা করবেন বিশ্ব ও আঞ্চলিক পরিস্থিতি বিবেচনায় নিয়ে সৃষ্টিশীল ভাবে ভাবতে দেরি করবেন না সুনির্দিষ্ট সামাজিক ঐতিহাসিক ও সাংস্কৃতিক বাস্তবতা বিচার করে নিজেদেরই লড়াই সংগ্রামের অভিজ্ঞতার আলোকে ইসলাম প্রশ্নে্র মীমাংসা তারা করবেন এই কাজ এড়িয়ে যাবার বিশেষ আর উপায় নাই তৃতীয়ত এই সমাবেশের তাৎপর্য হেফাজতে ইসলামের দাবির মধ্যে নয় বরং সমাবেশে লক্ষ লক্ষ মানুষের উপস্থিতি নিশ্চিত করার মধ্য দিয়ে তাদের সাংগঠনিক ক্ষমতা প্রদর্শন হেফাজতে ইসলাম সমাবেশে তাদের ১৩ দফা দাবি পেশ করেছে যেসব দাবিগুলোর প্রতি সমাজে আপত্তি উঠেছে এবং সেই দাবিকে প্রচার প্রপাগাণ্ডার কেন্দ্রে আনা হচ্ছে সেইসব নতুন কোন দাবি নয় আমরা চাই বা না চাই ভবিষ্যতে এই দাবির পক্ষে বিপক্ষে তর্কবিতর্ক ও জনমতই রাজনীতির গুরুত্বপূর্ণ নির্ণায়ক হয়ে উঠবে নিজের মত প্রকাশ ও শান্তিপূর্ণ ভাবে সভা সমাবেশ করবার অধিকার বাংলাদেশের যে কোন নাগরিকের আছে হেফাজতের ১৩ দফা আমরা সমর্থন করি বা না করি নাগরিক আমাদের স্বীকার করতে হবে যাদের আমরা সমাজের বাইরে রেখে দিয়েছি কথা বলতে দেইনি যাদের ব্যাপারে অযৌক্তিক আতংক আমাদের মধ্যে কাজ করে – এই সমাজ ও রাষ্ট্র তাদেরও অন্যের অধিকার অস্বীকার করলে নিজের অধিকার রক্ষার নিশ্চয়তা আমরা হারাই তাদের ‘অশিক্ষিত’ ‘বর্বর’ ‘অসভ্য’ বলার মধ্য দিয়ে নিজের অশিক্ষা বর্বরতা ও অসভ্যতাই আমরা প্রকাশ করি যে কারুরই আমরা বিরোধিতা করতে পারি সমালোচনা করতে পারি কিন্তু তার নাগরিক অধিকার যদি আমরা স্বীকার না করি তাহলে বাংলাদেশকে আরও অন্ধকার গহ্বরে আমরা ঠেলে দেব হেফাজতে ইসলামের ১৩ দফা আমাদের মধ্যযুগে ফিরিয়ে নিয়ে যাবে না কারন ইতিহাস যা অতিক্রম করে আসে সেখানে প্রত্যাবর্তন করে না যদিও বর্তমানে থেকে অতীতের ভার কাঁধে নিয়েই তাকে ভবিষ্যৎ গঠনের কাজ করে যেতে হয় সেই দিক থেকে নাগরিক অধিকার অস্বীকার করবার রাজনীতি ও সংস্কৃতিটাই বরং মধ্যযুগীয় গণতান্ত্রিক রাষ্ট্র গঠনের ক্ষেত্রে গরিব ও সমাজের প্রান্তিক মানুষগুলোর অংশগ্রহণের সুযোগ দূরে থাক তাদের কথা বলার অধিকারও আমরা স্বীকার করি না কারণ আমাদের আপত্তি তারা ধর্মের ভাষায় কথা বলে পবিত্র কোরান শরিফকে আক্ষরিক ভাবে ব্যাখ্যা করে কথায় কথায় হাদিসের উদাহরণ দেয় পুঁজিতান্ত্রিক ভোগী সমাজে গা ঢেলে দেবার বিরোধিতা করে নীতিনৈতিকতার ওপর অতিরিক্ত জোর দেয় ইত্যাদি এতে আমাদের মধ্যবিত্ত জীবন আতংকিত বোধ করে আমরা চিৎকার শুরু করি তের দফা মানা যায় না ফলে ধর্মতাত্ত্বিক বয়ানের মোড়কের মধ্যে এই মানুষগুলোর নৈতিক সামাজিক সাংস্কৃতিক ও রাজনৈতিক উদ্বিগ্নতা আমাদের কানে এসে পোঁছায় না কারন এদের আমরা মানুষ বলেই গণ্য করি না আমরা আগেই প্রচার শুরু করি বাংলাদেশ তালেবান হয়ে যাচ্ছে হেফাজতে ইসলামের হাত থেকে পাশ্চাত্য শক্তি এখন আমাদের রক্ষা করুক পাশ্চাত্য সভ্যতা ছাড়া অন্য কোন সভ্যতা আমরা কল্পনাও করতে অক্ষম হেফাজতিদের হাত থেকে নিষ্কৃতি পাবার কাতর প্রার্থনায় আকাশ বাতাস ধ্বনিত হয়ে ওঠে নিজেদের বদ্ধমূল কুসংস্কারের দুর্গন্ধ নিজেদের নাকে এসেও আর লাগে না বহুদিন হয় আমাদের ঘ্রাণ শক্তিসহ ইন্দ্রিয়ের অন্যান্য বৃত্তিও আমরা নষ্ট করে ফেলেছি আসুন নিজেরা মধ্যযুগীয় কুসংস্কার থেকে আগে মুক্ত হবার চেষ্টা করি তার আগে অন্যকে মুক্তির বাণী শোনানোর অভ্যাস যতো তাড়াতাড়ি ত্যাগ করতে পারব ততোই আমরা রাজনৈতিক ভাবে হুঁশে আসব অন্তত এক কদম এগিয়ে যাবো)

    # Pick a random value out of a given range.
    def value_in_range(range)
      case range.first
      when Integer then number_in_range(range)
      when Time then time_in_range(range)
      when Date then date_in_range(range)
      else range.to_a[rand(range.to_a.size)]
      end
    end

    # Generate a given number of words. If a range is passed, it will generate
    # a random number of words within that range.
    def words(total)
      (1..interpret_value(total)).map { WORDS[rand(WORDS.size)] }.join(' ')
    end

    # Generate a given number of sentences. If a range is passed, it will generate
    # a random number of sentences within that range.
    def sentences(total)
      (1..interpret_value(total)).map do
        words(5..20).capitalize
      end.join('। ')
    end

    # Generate a given number of paragraphs. If a range is passed, it will generate
    # a random number of paragraphs within that range.
    def paragraphs(total)
      (1..interpret_value(total)).map do
        '<p>' + sentences(3..8).capitalize + '</p>'
      end.join('')
    end

    # If an array or range is passed, a random value will be selected to match.
    # All other values are simply returned.
    def interpret_value(value)
      case value
      when Array then value[rand(value.size)]
      when Range then value_in_range(value)
      else value
      end
    end

    private

    def time_in_range(range)
      Time.at number_in_range(Range.new(range.first.to_i, range.last.to_i, range.exclude_end?))
    end

    def date_in_range(range)
      Date.jd number_in_range(Range.new(range.first.jd, range.last.jd, range.exclude_end?))
    end

    def number_in_range(range)
      if range.exclude_end?
        rand(range.last - range.first) + range.first
      else
        rand((range.last+1) - range.first) + range.first
      end
    end
  end

  extend Random # load it into the populator module directly so we can call the methods
end
